In [4]:
from sklearn.model_selection import train_test_split # splitting the dataset
from sklearn.linear_model import LinearRegression # regression algorithm
from sklearn.metrics import r2_score # accuracy metric
import numpy as np # linear algebra
import pandas as pd # data processing 
import matplotlib.pyplot as plt # data plotting
import seaborn as sb # data plotting

In [5]:
df = pd.read_csv("Car Dataset.csv")

In [6]:
df.head()

          Car       Model  Volume  Weight  CO2
0      Toyota        Aygo    1000     790   99
1  Mitsubishi  Space Star    1200    1160   95
2       Skoda      Citigo    1000     929   95
3        Fiat         500     900     865   90
4        Mini      Cooper    1500    1140  105

In [8]:
X = df[['Weight', 'Volume']]
y = df['CO2']
X= np.array(X)
y=np.array(y)
y=y.reshape(-1,1)
X_train,X_test,y_train,y_test=train_test_split(X,y,random_state=42)

    Weight  Volume
0      790    1000
1     1160    1200
2      929    1000
3      865     900
4     1140    1500
5      929    1000
6     1109    1400
7     1365    1500
8     1112    1500
9     1150    1600
10     980    1100
11     990    1300
12    1112    1000
13    1252    1600
14    1326    1600
15    1330    1600
16    1365    1600
17    1280    2200
18    1119    1600
19    1328    2000
20    1584    1600
21    1428    2000
22    1365    2100
23    1415    1600
24    1415    2000
25    1465    1500
26    1490    2000
27    1725    2000
28    1523    1600
29    1705    2000
30    1605    2100
31    1746    2000
32    1235    1600
33    1390    1600
34    1405    1600
35    1395    2500

In [9]:
reg=LinearRegression()
reg.fit(X_train,y_train)
y_pred = reg.predict(X_test)
print(y_pred)
print(r2_score(y_test,y_pred))

[[106.31236082]
 [101.22176309]
 [104.83576743]
 [106.16925734]
 [102.09723585]
 [106.81913934]
 [104.35541954]
 [ 97.4819742 ]
 [ 99.69458451]]
0.3779609856472951